cmsis-svd/cmsis-svd/data/Nuvoton/NUC123AE_v1.svd
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOA11_DOUT</name>
          <displayName>GPIOA11_DOUT</displayName>
          <description>GPIO Port A Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOA12_DOUT</name>
          <displayName>GPIOA12_DOUT</displayName>
          <description>GPIO Port A Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOA13_DOUT</name>
          <displayName>GPIOA13_DOUT</displayName>
          <description>GPIO Port A Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOA14_DOUT</name>
          <displayName>GPIOA14_DOUT</displayName>
          <description>GPIO Port A Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOA15_DOUT</name>
          <displayName>GPIOA15_DOUT</displayName>
          <description>GPIO Port A Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOB0_DOUT</name>
          <displayName>GPIOB0_DOUT</displayName>
          <description>GPIO Port A Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB1_DOUT</name>
          <displayName>GPIOB1_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB2_DOUT</name>
          <displayName>GPIOB2_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB3_DOUT</name>
          <displayName>GPIOB3_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB4_DOUT</name>
          <displayName>GPIOB4_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB5_DOUT</name>
          <displayName>GPIOB5_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB6_DOUT</name>
          <displayName>GPIOB6_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB7_DOUT</name>
          <displayName>GPIOB7_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB8_DOUT</name>
          <displayName>GPIOB8_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB9_DOUT</name>
          <displayName>GPIOB9_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB10_DOUT</name>
          <displayName>GPIOB10_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB11_DOUT</name>
          <displayName>GPIOB11_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB12_DOUT</name>
          <displayName>GPIOB12_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB13_DOUT</name>
          <displayName>GPIOB13_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB14_DOUT</name>
          <displayName>GPIOB14_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB15_DOUT</name>
          <displayName>GPIOB15_DOUT</displayName>
          <description>GPIO Port B Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="GPIOA10_DOUT">
          <name>GPIOC0_DOUT</name>
          <displayName>GPIOC0_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC1_DOUT</name>
          <displayName>GPIOC1_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC2_DOUT</name>
          <displayName>GPIOC2_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC3_DOUT</name>
          <displayName>GPIOC3_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC4_DOUT</name>
          <displayName>GPIOC4_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC5_DOUT</name>
          <displayName>GPIOC5_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC6_DOUT</name>
          <displayName>GPIOC6_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC7_DOUT</name>
          <displayName>GPIOC7_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC8_DOUT</name>
          <displayName>GPIOC8_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC9_DOUT</name>
          <displayName>GPIOC9_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x2A4</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC10_DOUT</name>
          <displayName>GPIOC10_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x2A8</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC11_DOUT</name>
          <displayName>GPIOC11_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x2AC</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC12_DOUT</name>
          <displayName>GPIOC12_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x2B0</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC13_DOUT</name>
          <displayName>GPIOC13_DOUT</displayName>
          <description>GPIO Port C Pin I/O Bit Output/Input Control</description>
          <addressOffset>0x2B4</addressOffset>
       </register>
